cf_billing/InformationRegisters/бестНастройкаПериодовЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкаПериодовЗадолженности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>От</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>До</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КатегорияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкаПериодовЗадолженности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКатегорииЗадолженности(МВТ = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкаПериодовЗадолженности.КатегорияЗадолженности КАК КатегорияЗадолженности,
		|	бестНастройкаПериодовЗадолженности.От КАК От,
		|	бестНастройкаПериодовЗадолженности.До КАК До
		|ПОМЕСТИТЬ НастройкиПериодовЗадолженности
		|ИЗ
		|	РегистрСведений.бестНастройкаПериодовЗадолженности КАК бестНастройкаПериодовЗадолженности";
	
	
	Если МВТ <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МВТ;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОМЕСТИТЬ НастройкиПериодовЗадолженности", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
